IDEA StatiCa Open Model
ConnectionSetup.BearingCheck Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Apply bearing check including αb
 Namespace: IdeaRS.OpenModel
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public bool BearingCheck { get; set; }
Public Property BearingCheck As Boolean
	Get
	Set
public:
property bool BearingCheck {
	bool get ();
	void set (bool value);
}
Property Value
Type: Boolean
See Also
Reference
ConnectionSetup Class
IdeaRS.OpenModel Namespace